app/controllers/events_controller.rb

SELECT name FROM "options" WHERE "options"."eventId" = 1
---
  def getOptions
    @options = Option.select_public.where(:eventId => params[:id])

INSERT INTO "events" ("created_at", "name", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Sat, 13 Jul 2013 12:28:07 UTC +00:00], ["name", "Bday Party"], ["updated_at", Sat, 13 Jul 2013 12:28:07 UTC +00:00], ["url", "http://localhost:3000/Bday Party"]]
---
  def create
    @event = Event.new(params[:event])
    @event.url = BASE_URL + @event.name.gsub(' ', '_')

    respond_to do |format|
      if @event.save