app/controllers/options_controller.rb

SELECT "options".* FROM "options"
---
  def index
    @options = Option.all

INSERT INTO "options" ("created_at", "eventId", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 13 Jul 2013 12:21:47 UTC +00:00], ["eventId", 1], ["name", "Man of Steel"], ["updated_at", Sat, 13 Jul 2013 12:21:47 UTC +00:00]]
---
  def create
    @option = Option.new(option_params)
    @option.eventId = @@event_id
    respond_to do |format|
      if @option.save

SELECT "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_option
      @option = Option.find(params[:id])