app/controllers/votes_controller.rb

SELECT "options".* FROM "options" WHERE "options"."eventId" = 1
SELECT "votes".* FROM "votes"
---
  def index
    @eventId = params[:id];
    @options = Option.where(:eventId => @eventId);
    @votes = Vote.all